namespace lab_4
{
    class Program
    {
        static void Main()
        {
            var магазин = new Магазин();

            var товар1 = new Товар("Ноутбук", 1000, "Потужний ноутбук", "Електроніка");
            var товар2 = new Товар("Футболка", 20, "Зручна футболка", "Одяг");
            магазин.ДодатиТовар(товар1);
            магазин.ДодатиТовар(товар2);

            var користувач = new Користувач("user1", "password1");
            магазин.ДодатиКористувача(користувач);

            магазин.ЗробитиЗамовлення(користувач, new List<Товар> { товар1, товар2 }, 2);

            Console.WriteLine("Історія покупок користувача:");
            foreach (var замовлення in користувач.ІсторіяПокупок)
            {
                Console.WriteLine($"Замовлення: Загальна вартість - {замовлення.ЗагальнаВартість}, Статус - {замовлення.Статус}");
            }

            Console.WriteLine("\nПошук товарів за критеріями:");
            var результатиПошуку = магазин.Пошук(0, 50, "Одяг");
            foreach (var товар in результатиПошуку)
            {
                Console.WriteLine($"Товар: {товар.Назва}, Ціна - {товар.Ціна}, Категорія - {товар.Категорія}");
            }

        }
    }
}